app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories`
---
  def index
    respond_with(@categories = Category.all)