app/controllers/prices_controller.rb

SELECT `prices`.* FROM `prices`
---
  def index
    @prices = Price.all